---
kind: method
id: M:Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.GetSolarHeatGainCoefficientsForSolarIndicientAngles
source: html/92ef74d2-14ac-a155-4f64-120ef770c68e.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisWindowType.GetSolarHeatGainCoefficientsForSolarIndicientAngles Method

Returns a map with solar heat gain coefficients (SHGC-values) for specific incident angles for the window type.

## Syntax (C#)
```csharp
public IDictionary<double, double> GetSolarHeatGainCoefficientsForSolarIndicientAngles()
```